src/cf/src/Catalogs/СтруктураПредприятия/СтруктураПредприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтруктураПредприятия</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ИсторияПредприятия</name>
      <description>История предприятия</description>
    </items>
    <items>
      <name>СлужебнаяПапка</name>
      <description>Служебная папка</description>
    </items>
  </predefined>
  <attributes>
    <name>ВключеноОбновлениеСпискаБаз1С</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаAD</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьККаталогуПодразделения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавлятьПользователейАвтоИБ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоответствиеСтруктуреAD</name>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипРеквизита</name>
      <type>
        <types>EnumRef.ТипРеквизитаAD</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/Catalogs/СтруктураПредприятия/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОтображениеИнформацииНаФорме();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыбораГруппыAD_СтруктураПредприятия" Тогда
		Объект.ГруппаAD = Параметр;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОтображениеИнформацииНаФорме();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РодительПриИзменении(Элемент)
	
	ОтображениеИнформацииНаФорме();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаADНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("ДеревоADФормы", ДеревоADФормы);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Справочник.СтруктураПредприятия.Форма.ВыборГруппыAD", ПараметрыФормы);	
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаADПриИзменении(Элемент)
	
	Если Объект.ГруппаAD="" Тогда
		// очистка организации
		Объект.Организация = "";
	КонецЕсли;
	
	ОтображениеИнформацииНаФорме();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Отображение информации на форме по определенным условиям
&НаКлиенте
Процедура ОтображениеИнформацииНаФорме() 
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		// для новых недоступны для правки настройки
		Элементы.ДекорацияИнформацияОНастройках.Видимость = Истина;
		Элементы.ГруппаНастроек.Доступность = Ложь;
		Возврат;
	Иначе
		Элементы.ДекорацияИнформацияОНастройках.Видимость = Ложь;
		Элементы.ГруппаНастроек.Доступность = Истина;
	КонецЕсли;
	
	Элементы.ГруппаСоответствиеСтруктуреAD.Видимость = Не ПринадлежностьКСлужебнойПапке(Объект.Ссылка);
	
	// Только если заполнена группа принадлежности к AD, можно выбирать организацию для заполнения.
	Элементы.Организация.Видимость = ЗначениеЗаполнено(Объект.ГруппаAD);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПринадлежностьКСлужебнойПапке(СтруктураПредприятияСсылка) 
	
	Если Не ЗначениеЗаполнено(СтруктураПредприятияСсылка) Тогда
		Возврат Истина;	
	КонецЕсли;
	
	Если СтруктураПредприятияСсылка.ПринадлежитЭлементу(Справочники.СтруктураПредприятия.СлужебнаяПапка) 
		Или СтруктураПредприятияСсылка = Справочники.СтруктураПредприятия.СлужебнаяПапка 
		Или СтруктураПредприятияСсылка.ПринадлежитЭлементу(Справочники.СтруктураПредприятия.ИсторияПредприятия) 
		Или СтруктураПредприятияСсылка = Справочники.СтруктураПредприятия.ИсторияПредприятия Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти
